In [3]:
import pandas as pd
import numpy as np

## Pandas has two different type of data structures âˆ’
### Series
### DataFrame

In [5]:
s = pd.Series()
print(s)
print(type(s))

Series([], dtype: float64)
<class 'pandas.core.series.Series'>

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [6]:
data = np.array(['a','b','c','d','e','f'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [7]:
data = ['a','b','c','d']
s = pd.Series(data,index=[100,201,102,105])
print (s)

100    a
201    b
102    c
105    d
dtype: object

In [6]:
data = {'a' : 0, 'b' : 1, 'c' : 2}
s = pd.Series(data)
print (s)

a    0
b    1
c    2
dtype: int64

In [9]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
print (s)

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [9]:
s = pd.Series(5, index=[0, 1, 2, 3, 4])
print(s)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [9]:
s = pd.Series([1,2.2,"xyz",4,5],index = ['a','b','c','d','e'])
print(s)
print(type(s))

a      1
b    2.2
c    xyz
d      4
e      5
dtype: object
<class 'pandas.core.series.Series'>

In [11]:
s[0:5:2]

a    1
c    3
e    5
dtype: int64

## Dataframe

In [2]:
import pandas as pd
data = [['Alex',10,11],['Bob',12,14],['Clarke',13,15],['Tom',17,19]]
df = pd.DataFrame(data,columns=['Name','Age','no'])
df

     Name  Age  no
0    Alex   10  11
1     Bob   12  14
2  Clarke   13  15
3     Tom   17  19

In [12]:
len(data)

4

In [12]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [13]:
type(df)

pandas.core.frame.DataFrame

In [11]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [11]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=[0,1])
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [17]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'c'])
df1

        a     c
first   1   NaN
second  5  20.0

In [12]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df3 = df.append(df2)
df3

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [13]:
df = df3.drop(0)
df

   a  b
1  3  4
1  7  8

In [4]:
a=pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack'])
a

0      Tom
1    James
2    Ricky
3      Vin
4    Steve
5    Smith
6     Jack
dtype: object

In [5]:
d = {'Name':a,
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3,3.98,2.56,3.20,4.6,3.8])}

# Create a DataFrame
df = pd.DataFrame(d)
df

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.00
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [22]:
print ("The transpose of the data series is:")
df.T

The transpose of the data series is:

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23      3   3.98  2.56    3.2    4.6   3.8

In [46]:
df.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [47]:
df.ndim

2

In [18]:
df

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.00
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [12]:
df.shape

(7, 3)

In [49]:
df.size

21

In [14]:
print(df.keys())

Index(['Name', 'Age', 'Rating'], dtype='object')

In [9]:
for i in df.keys():
    print(i)

Name
Age
Rating

In [12]:
print(df.values)

[['Tom' 25 4.23]
 ['James' 26 3.0]
 ['Ricky' 25 3.98]
 ['Vin' 23 2.56]
 ['Steve' 30 3.2]
 ['Smith' 29 4.6]
 ['Jack' 23 3.8]]

In [20]:
df

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.00
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [20]:
df.head(4)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.00
2  Ricky   25    3.98
3    Vin   23    2.56

In [21]:
df.tail(3)

    Name  Age  Rating
4  Steve   30     3.2
5  Smith   29     4.6
6   Jack   23     3.8

In [93]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df["Name"]

0        Tom
1      James
2      Ricky
3        Vin
4      Steve
5      Smith
6       Jack
7        Lee
8      David
9     Gasper
10    Betina
11    Andres
Name: Name, dtype: object

In [27]:
type(df["Name"])

pandas.core.series.Series

In [28]:
df["Age"]

0     25
1     26
2     25
3     23
4     30
5     29
6     23
7     34
8     40
9     30
10    51
11    46
Name: Age, dtype: int64

In [30]:
df["Age"].sum()

382

In [36]:
df["Age"].mean()

31.833333333333332

In [37]:
df["Age"].min()

23

In [38]:
df["Age"].max()

51

In [39]:
df['Age'].sort_index()

0     25
1     26
2     25
3     23
4     30
5     29
6     23
7     34
8     40
9     30
10    51
11    46
Name: Age, dtype: int64

In [64]:
df['Age'].sort_index(ascending=False)

11    46
10    51
9     30
8     40
7     34
6     23
5     29
4     30
3     23
2     25
1     26
0     25
Name: Age, dtype: int64

In [36]:
df['Age']

0     25
1     26
2     25
3     23
4     30
5     29
6     23
7     34
8     40
9     30
10    51
11    46
Name: Age, dtype: int64

In [31]:
a = df['Age'].tolist()
a.sort(reverse = True)
print(a)

[51, 46, 40, 34, 30, 30, 29, 26, 25, 25, 23, 23]

In [32]:
df.columns = ("First_name","Current_age",'Score')

In [33]:
df

   First_name  Current_age  Score
0         Tom           25   4.23
1       James           26   3.24
2       Ricky           25   3.98
3         Vin           23   2.56
4       Steve           30   3.20
5       Smith           29   4.60
6        Jack           23   3.80
7         Lee           34   3.78
8       David           40   2.98
9      Gasper           30   4.80
10     Betina           51   4.10
11     Andres           46   3.65

In [34]:
df.to_csv("temp.csv")

In [3]:
r = pd.read_csv('temp.csv')
r

    Unnamed: 0 First_name  Current_age  Score
0            0        Tom           25   4.23
1            1      James           26   3.24
2            2      Ricky           25   3.98
3            3        Vin           23   2.56
4            4      Steve           30   3.20
5            5      Smith           29   4.60
6            6       Jack           23   3.80
7            7        Lee           34   3.78
8            8      David           40   2.98
9            9     Gasper           30   4.80
10          10     Betina           51   4.10
11          11     Andres           46   3.65
12          12        xyz           65   3.20

In [ ]:
r.drop(['Unnamed: 0'],axis=1)

In [52]:
del r['Unnamed: 0']

In [53]:
r

   First_name  Current_age  Score
0         Tom           25   4.23
1       James           26   3.24
2       Ricky           25   3.98
3         Vin           23   2.56
4       Steve           30   3.20
5       Smith           29   4.60
6        Jack           23   3.80
7         Lee           34   3.78
8       David           40   2.98
9      Gasper           30   4.80
10     Betina           51   4.10
11     Andres           46   3.65
12        xyz           65   3.20

In [66]:
r.iloc[5:,1:-1]

    Current_age  Score
5            29   4.60
6            23   3.80
7            34   3.78
8            40   2.98
9            30   4.80
10           51   4.10
11           46   3.65
12           65   3.20

In [67]:
r.iloc[:,:2]

   First_name  Current_age
0         Tom           25
1       James           26
2       Ricky           25
3         Vin           23
4       Steve           30
5       Smith           29
6        Jack           23
7         Lee           34
8       David           40
9      Gasper           30
10     Betina           51
11     Andres           46
12        xyz           65

In [61]:
r.head(5)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20

In [62]:
r.tail(5)

      Name  Age  Rating
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65
12   Utsav   20    2.50
13     XYZ   50    4.50

In [2]:
import pandas as pd

In [3]:
pd.read_csv?

In [100]:
df = pd.read_csv("iris.data",names=["s_length","s_width","p_length","p_width","class"])
df

     s_length  s_width  p_length  p_width           class
0         5.1      3.5       1.4      0.2     Iris-setosa
1         4.9      3.0       1.4      0.2     Iris-setosa
2         4.7      3.2       1.3      0.2     Iris-setosa
3         4.6      3.1       1.5      0.2     Iris-setosa
4         5.0      3.6       1.4      0.2     Iris-setosa
..        ...      ...       ...      ...             ...
145       6.7      3.0       5.2      2.3  Iris-virginica
146       6.3      2.5       5.0      1.9  Iris-virginica
147       6.5      3.0       5.2      2.0  Iris-virginica
148       6.2      3.4       5.4      2.3  Iris-virginica
149       5.9      3.0       5.1      1.8  Iris-virginica

[150 rows x 5 columns]

In [103]:
ctr = 0
for i,j in zip(df["s_length"],df["p_width"]):
    if i == 5.0:
        print(j)
        ctr = ctr + 1
print("*****",ctr)

0.2
0.2
0.2
0.4
0.2
0.3
0.6
0.2
1.0
1.0
***** 10

In [85]:
df["class"].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [104]:
import csv

In [107]:
data= [("hello",22,45),('tom',21,45),('Mike',20,70)]

In [109]:
csvfile=open ('new.csv','a', newline='')
obj=csv.writer(csvfile)
for i in data:
    obj.writerow(i)
#     print(i)
csvfile.close()

In [68]:
a = pd.DataFrame(data)
a.to_csv("new.csv")

In [69]:
df = pd.read_csv("new.csv")
df

   Unnamed: 0      0   1   2
0           0  hello  22  45
1           1    tom  21  45
2           2   Mike  20  70

In [70]:
del df["Unnamed: 0"]

In [71]:
df

       0   1   2
0  hello  22  45
1    tom  21  45
2   Mike  20  70